+ui/Keybindings.org
#+TITLE: Keybindings
#+STARTUP: overview
#+OPTIONS: H:3 toc:nil
#+PROPERTY: header-args:emacs-lisp :tangle +keybindings.el

Keybindings is quite a powerful aspect of Emacs and we will install
some helper utilities to help us with it.

* Some Global Definitions

** The Leader Key

#+BEGIN_SRC emacs-lisp
(defconst medivhok:menu:leader "SPC"
  "The leader key.")

(defconst medivhok:menu:nn-leader "M-SPC"
  "The 'non normal state' leader key.")
#+END_SRC

** Helper Functions

#+BEGIN_SRC emacs-lisp
(defun medivhok:menu/prepend-leader (menu-key &optional use-non-normal-leader)
  "Returns a string of the MENU-KEY prefixed by `medivhok:menu:leader' and
a space. If USE-NON-NORMAL-LEADER is non nil, `medivhok:menu:nn-leader'
is used instead."
  (if use-non-normal-leader
      (concat medivhok:menu:nn-leader " " menu-key)
    (concat medivhok:menu:leader " " menu-key)))
#+END_SRC

* The Root of All Evil

#+BEGIN_QUOTE
"So, Lone Starr, now you see that evil will always triumph, because good is dumb." -- Dark Helmet, [[https://www.imdb.com/title/tt0094012/][Spaceballs]]
#+END_QUOTE

** evil

#+BEGIN_SRC emacs-lisp
  (use-package evil
    :init
    (setq evil-want-integration t
            evil-want-keybinding nil
            evil-want-C-u-scroll t
            evil-want-C-i-jump nil
            evil-respect-visual-line-mode t)

    :config
    (evil-mode 1))
#+END_SRC

** evil-collection

#+BEGIN_SRC emacs-lisp
  (use-package evil-collection
    :defer t
    :after evil

    :config
    (setq evil-collection-outline-bind-tab-p nil))
#+END_SRC

* Packages For The Menus
*** which-key

#+BEGIN_QUOTE
Emacs package that displays available keybindings in popup. -- [[https://github.com/justbur/emacs-which-key][which-key]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp
(use-package which-key
  :config
  (setq which-key-idle-delay 0.3)
  (which-key-mode))
#+END_SRC

*** hydra

#+BEGIN_QUOTE
make Emacs bindings that stick around. -- [[https://github.com/abo-abo/hydra][hydra]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp
(use-package hydra)
#+END_SRC

*** general

#+BEGIN_QUOTE
More convenient key definitions in emacs. -- [[https://github.com/noctuid/general.el][general.el]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp
(use-package general
  :config
  (general-evil-setup t))
#+END_SRC

* The Menus

#+BEGIN_SRC emacs-lisp
(defhydra hydra-zoom ()
  "zoom"
  ("-" text-scale-decrease "out")
  ("=" text-scale-increase "in"))

(general-create-definer medivhok:menu:main
  :prefix medivhok:menu:leader
  :non-normal-prefix medivhok:menu:nn-leader
  :keymaps 'override)

(medivhok:menu:main
  :states 'normal
  ":" 'execute-extended-command
  "-" '(hydra-zoom/text-scale-decrease
        :which-key "text-scale-decrease")
  "=" '(hydra-zoom/text-scale-increase
        :which-key "text-scale-increase"))
#+END_SRC

| Menu       | Key |
|------------+-----|
| [[#keybindings--menu--agenda][Agenda]]     | ~a~ |
| Buffers    | ~b~ |
| Emacs      | ~e~ |
| Files      | ~f~ |
| Help       | ~h~ |
| Local Mode | ~m~ |
| Notes      | ~n~ |
| Window     | ~w~ |
| Quit       | ~q~ |

** Agenda Menu
:PROPERTIES:
:custom_id: keybindings--menu--agenda
:END:

The menu for the [[../+app/Agenda.org][agenda]] application.

#+BEGIN_SRC emacs-lisp
(general-create-definer medivhok:menu:agenda
  :prefix (medivhok:menu/prepend-leader "a")
  :non-normal-prefix (medivhok:menu/prepend-leader "a" t)
  :keymaps 'override
  nil '(:ignore t :which-key "agenda"))
#+END_SRC

** Buffer Menu
:PROPERTIES:
:custom_id: keybindings--buffer-menu
:END:

#+BEGIN_SRC emacs-lisp
(general-create-definer medivhok:menu:buffer
  :prefix (medivhok:menu/prepend-leader "b")
  :non-normal-prefix (medivhok:menu/prepend-leader "b" t)
  :keymaps 'override
  nil '(:ignore t :which-key "buffer"))

(medivhok:menu:buffer
  :states 'normal
  "b" 'switch-to-buffer
  "k" 'kill-buffer
  "d" 'kill-current-buffer)
#+END_SRC

** Emacs Menu
:PROPERTIES:
:custom_id: keybindings--emacs-menu
:END:

#+BEGIN_SRC emacs-lisp
(general-create-definer medivhok:menu:emacs
  :prefix (medivhok:menu/prepend-leader "e")
  :non-normal-prefix (medivhok:menu/prepend-leader "e" t)
  :keymaps 'override
  nil '(:ignore t :which-key "emacs"))

(medivhok:menu:emacs
  :states 'normal
  "e" '((lambda ()
          (interactive)
          (find-file
           (expand-file-name "README.org"
                             (file-name-directory medivhok:cfg-directory))))
        :which-key "edit literate config"))
#+END_SRC

** File Menu
:PROPERTIES:
:custom_id: keybindings--file-menu
:END:

#+BEGIN_SRC emacs-lisp
(general-create-definer medivhok:menu:file
  :prefix (medivhok:menu/prepend-leader "f")
  :non-normal-prefix (medivhok:menu/prepend-leader "f" t)
  :keymaps 'override
  nil '(:ignore t :which-key "file"))

(medivhok:menu:file
  :states 'normal
  "f" 'find-file
  "r" 'counsel-recentf)
#+END_SRC

** Help Menu
:PROPERTIES:
:custom_id: keybindings--help-menu
:END:

#+BEGIN_SRC emacs-lisp
(general-create-definer medivhok:menu:help
  :prefix (medivhok:menu/prepend-leader "h")
  :non-normal-prefix (medivhok:menu/prepend-leader "h" t)
  :keymaps 'override
  nil '(:ignore t :which-key "help"))

(medivhok:menu:help
  :states 'normal
  "a" 'apropos-command
  "b" 'describe-bindings
  "c" 'describe-face
  "f" 'describe-function
  "i" 'info
  "k" 'general-describe-keybindings
  "s" 'counsel-describe-symbol
  "v" 'describe-variable)
#+END_SRC

** Local Menu
:PROPERTIES:
:custom_id: keybindings--local-menu
:END:

#+BEGIN_SRC emacs-lisp
(general-create-definer medivhok:menu:local
  :prefix (medivhok:menu/prepend-leader "m")
  :non-normal-prefix (medivhok:menu/prepend-leader "m" t)
  :keymaps 'override)
#+END_SRC

** Notes Menu
:PROPERTIES:
:custom_id: keybindings--notes-menu
:END:

#+BEGIN_SRC emacs-lisp
(general-create-definer medivhok:menu:notes
  :prefix (medivhok:menu/prepend-leader "n")
  :non-normal-prefix (medivhok:menu/prepend-leader "n" t)
  :keymaps 'override
  nil '(:ignore t :which-key "notes"))
#+END_SRC

** Window Menu
:PROPERTIES:
:custom_id: keybindings--window-menu
:END:

#+BEGIN_SRC emacs-lisp
(general-create-definer medivhok:menu:window
  :prefix (medivhok:menu/prepend-leader "w")
  :non-normal-prefix (medivhok:menu/prepend-leader "w" t)
  :keymaps 'override
  nil '(:ignore t :which-key "window"))

(medivhok:menu:window
  :states 'normal
  "q" 'delete-window
  "s" 'split-window-below
  "\\" 'split-window-right)
#+END_SRC

** Quit Menu
:PROPERTIES:
:custom_id: keybindings--quit-menu
:END:

#+BEGIN_SRC emacs-lisp
(general-create-definer medivhok:menu:quit
  :prefix (medivhok:menu/prepend-leader "q")
  :non-normal-prefix (medivhok:menu/prepend-leader "q" t)
  :keymaps 'override
  nil '(:ignore t :which-key "quit"))

(medivhok:menu:quit
  :states 'normal
  "q" 'save-buffers-kill-terminal)
#+END_SRC
